app/Controllers/AuthController.php

    public function authenticate()
    {
        $session = session();
        $model = new UserModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'mila@gmail.com'
 LIMIT 1